package Lesson3;

public class App {

    /**
     * Арифметические операторы: +; -; *; /; %; ++; --
     * Операторы присваивания =; +=; -=; *=; /=
     * Операторы сравнения >, <, =, >=, <=; ==; !=
     * Логические операторы (и) && (все true), (или) ||  (только один true),  (тоже что и двойные,
     * но выполняются все операции) & |, (не равно)!,  logical exclusive or XOR, это ^ (когда только один true)
     */


    public static void main(String[] args) {

    char c = 'a'; //  порядковый номер в юникоде 97
    int i = 10;
    int i2 = c;
        System.out.println(i+c);

    }
}
