package Lesson10andHomework;

/**
 *  Import statement можно импортировать класс из пакета, или весь пакет поставив .*
 *  Static impirt statement можно импортировать только статические элемены из класса / пакета
 */

/**
 * #1 Создайте пакет р1, в нём класс А. В пакете р1 создайте подпакет р2, в нём класс В со static элементами. В подпакете р2 создайте подпакет р3,
 * в нём класс С. Создайте новый пакет р4, в нем клавсс D. В пакете р4 создайте подпакет р5, в нем класс Е. Внутри класса D напишите код, который будет
 * задействовать любые элементы классов А,С,Е, а также static элементы класса В. Используя выражения import и import static,
 * работайте с не полными именами классов.
 */
public class ImportAndСomments {
}
