package Lesson8;

/**
 * NonAccessModifiers
 * final - может относиться к переменной variable (constant) значение переменной никогда не будет меняться, к методу, или классую, нет дефолтного значения
 * переменные должны быть инициализированны до их использования: 1 При определении переменной. 2 В каждом констректоре (если переменная не static)
 * в переменных типа референс мы не сможем поменять ссылку на объект(ссылаться на другой объект, но сам объект менять можем;
 * static элементы принадлежат всему классу, а не отдельным его объектам. Существуют и могут быть использованы без создания объекта класса.
 * static элементы: перемпенные и методы не могут обращаться к instance переменным и методам. К static элементам принято обращаться используя имя класса,
 * а не ссылку на созданные объект.
 *  abstract
 */

public class NonAccessModifiers {
}
